In [1]:
import json
import pandas as pd
import numpy as np
import re
from sqlalchemy import create_engine
from config import db_password
import time

In [2]:
file_dir = '../OSMI_MHIT_clean.csv'

In [3]:
f'{file_dir}filename'

'../OSMI_MHIT_clean.csvfilename'

In [4]:
file_dir_2 = '../salaries.csv'

In [5]:
mh_df=pd.read_csv('OSMI_MHIT_clean.csv', low_memory=False)
salaries_df=pd.read_csv('salaries.csv')

In [6]:
mh_df.head()

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,age,gender,country_live,live_us_state,country_work,work_us_state,work_position,remote,quantile_age_1,quantile_age_2
0,1,0,3,1,NaN,3,NaN,0,0,2,...,39,1,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]"
1,2,0,2,1,NaN,0,1.0,1,1,1,...,29,1,United States of America,Illinois,United States of America,Illinois,Back-end Developer|Front-end Developer,0,"(28.0, 32.0]","(27.0, 29.0]"
2,3,0,2,1,NaN,0,NaN,0,0,2,...,38,1,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,1,"(32.0, 38.0]","(37.0, 39.0]"
3,4,0,2,0,1.0,1,1.0,0,0,0,...,43,0,United States of America,Illinois,United States of America,Illinois,Executive Leadership|Supervisor/Team Lead|Dev ...,3,"(38.0, 99.0]","(39.0, 44.0]"
4,5,0,6,1,NaN,1,2.0,0,1,1,...,42,1,United Kingdom,NaN,United Kingdom,NaN,DevOps/SysAdmin|Support|Back-end Developer|Fro...,3,"(38.0, 99.0]","(39.0, 44.0]"

In [7]:
salaries_df.head()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
0,3/21/2016 13:32,NaN,0,NaN,0,0,0,0.0,0.0,-,Male,NaN
1,3/21/2016 14:39,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN
2,3/22/2016 14:01,1,1,NaN,1,1,1,1.0,1.0,1,Male,NaN
3,3/21/2016 14:05,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,NaN,NaN,NaN
4,3/22/2016 16:29,Intercom,Product Engineer,NaN,2,6,90000,10000.0,10000.0,"10,000.00",Female,NaN

In [8]:
mh_df.sample()

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,age,gender,country_live,live_us_state,country_work,work_us_state,work_position,remote,quantile_age_1,quantile_age_2
692,696,0,4,1,NaN,1,1.0,0,0,2,...,36,1,United States of America,Maine,United States of America,Massachusetts,Supervisor/Team Lead,3,"(32.0, 38.0]","(34.0, 37.0]"

In [9]:
mh_df.tail()

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,age,gender,country_live,live_us_state,country_work,work_us_state,work_position,remote,quantile_age_1,quantile_age_2
999,1003,0,4,1,NaN,2,2.0,0,2,2,...,26,0,Canada,NaN,Canada,NaN,Other,3,"(19.999, 28.0]","(25.0, 27.0]"
1000,1004,0,5,1,NaN,1,0.0,0,0,1,...,38,0,United States of America,Illinois,United States of America,Illinois,Support,1,"(32.0, 38.0]","(37.0, 39.0]"
1001,1005,0,4,1,NaN,1,1.0,1,1,2,...,52,1,United States of America,Georgia,United States of America,Georgia,Back-end Developer,3,"(38.0, 99.0]","(44.0, 99.0]"
1002,1006,0,4,0,1.0,2,2.0,0,1,2,...,30,0,United States of America,Nebraska,United States of America,Nebraska,DevOps/SysAdmin,3,"(28.0, 32.0]","(29.0, 30.0]"
1003,1007,0,4,1,NaN,1,0.0,0,0,2,...,25,3,Canada,NaN,Canada,NaN,Other,3,"(19.999, 28.0]","(19.0, 25.0]"

In [10]:
salaries_df.tail()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
3330,3/21/2016 14:32,aaaa,aaaa,NaN,12,12,123123,12.0,12.0,123,Male,adasd
3331,3/21/2016 15:17,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3332,8/11/2017 6:27,NaN,NaN,NaN,NaN,NaN,10,NaN,NaN,NaN,NaN,NaN
3333,3/21/2016 13:02,NaN,NaN,NaN,NaN,NaN,80000,NaN,NaN,NaN,NaN,NaN
3334,3/21/2016 22:50,NaN,NaN,NaN,NaN,NaN,23423,NaN,NaN,NaN,NaN,NaN

In [11]:
salaries_df.columns.tolist()

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [12]:
salaries_df[salaries_df['Job Title'].notnull()]

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
6,3/21/2016 15:19,Crittercism,"San Francisco, CA",Engineer,3,9,135000,0.0,6000.0,"50,000.00",Male,NaN
7,3/21/2016 13:16,NaN,London,Programmer,0.3,0,30187,0.0,0.0,-,Male,NaN
19,3/21/2016 14:03,Domo,"American Fork, UT",Account Executive,1,5,80000,25000.0,140000.0,"50,000.00",Male,NaN
20,3/21/2016 14:24,Eastman Chemical Company,"Kingsport, TN",Accountant,2,2,62000,2500.0,NaN,NaN,Male,NaN
21,3/21/2016 14:24,NaN,New York,Ad Ops Coordinator,1,1,55000,0.0,0.0,"20,000.00",Male,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
3323,3/23/2016 0:37,microsoft,VIenna,Working Student,1,1,1400,NaN,NaN,NaN,Male,NaN
3324,3/21/2016 15:14,NaN,NaN,xxx,NaN,NaN,75000,NaN,NaN,NaN,NaN,NaN
3325,3/21/2016 13:01,NaN,NaN,zz,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3326,3/21/2016 15:35,NaN,NaN,zz,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3327,3/22/2016 22:03,NaN,NaN,zz,NaN,NaN,23,NaN,NaN,NaN,Male,NaN

In [13]:
sorted(salaries_df.columns.tolist())

['Additional Comments',
 'Annual Base Pay',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Employer',
 'Gender',
 'Job Title',
 'Location',
 'Signing Bonus',
 'Timestamp',
 'Years at Employer',
 'Years of Experience']

In [14]:
[[column,salaries_df[column].isnull().sum()] for column in salaries_df.columns]

[['Timestamp', 0],
 ['Employer', 1547],
 ['Location', 461],
 ['Job Title', 26],
 ['Years at Employer', 326],
 ['Years of Experience', 290],
 ['Annual Base Pay', 0],
 ['Signing Bonus', 1138],
 ['Annual Bonus', 1037],
 ['Annual Stock Value/Bonus', 1444],
 ['Gender', 159],
 ['Additional Comments', 2873]]

In [15]:
[column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [16]:
salaries_columns_to_keep = [column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]
salaries_df = salaries_df[salaries_columns_to_keep]

In [17]:
salaries_df.dtypes

Timestamp                    object
Employer                     object
Location                     object
Job Title                    object
Years at Employer            object
Years of Experience          object
Annual Base Pay               int64
Signing Bonus               float64
Annual Bonus                float64
Annual Stock Value/Bonus     object
Gender                       object
Additional Comments          object
dtype: object

In [18]:
annual_base_pay = salaries_df['Annual Base Pay'].dropna()

In [19]:
salaries_df = salaries_df.drop(['Timestamp', 'Employer','Additional Comments','Years at Employer','Annual Stock Value/Bonus','Annual Bonus','Signing Bonus'], axis=1)

In [20]:
salaries_df = salaries_df[['Job Title', 'Location', 'Years of Experience', 'Annual Base Pay', 'Gender']]
salaries_df.head()

  Job Title          Location Years of Experience  Annual Base Pay  Gender
0       NaN                 0                   0                0    Male
1       NaN               NaN                 NaN                0     NaN
2       NaN                 1                   1                1    Male
3       NaN               NaN                 NaN                2     NaN
4       NaN  Product Engineer                   6            90000  Female

In [21]:
salaries_df = salaries_df.rename(columns={'Job Title': 'work_position'})

In [22]:
salaries_df.dtypes

work_position          object
Location               object
Years of Experience    object
Annual Base Pay         int64
Gender                 object
dtype: object

In [23]:
# Examining Job Title of Salaries Df
salaries_df['work_position'].value_counts()

Software Engineer                        513
Senior Software Engineer                 187
Software Developer                       163
Developer                                 91
Engineer                                  59
                                        ...
Development Team Lead                      1
Graduate Student / Research Assistant      1
Director, Online Marketing                 1
R&D Intern                                 1
programmer analyst 3                       1
Name: work_position, Length: 1203, dtype: int64

In [24]:
# Examining Job Title of MH Df
mh_df['work_position'].value_counts()

Back-end Developer                                                                     201
Front-end Developer                                                                    104
Other                                                                                   87
Supervisor/Team Lead                                                                    55
Back-end Developer|Front-end Developer                                                  53
                                                                                      ...
Supervisor/Team Lead|DevOps/SysAdmin|Support|Back-end Developer                          1
Other|Dev Evangelist/Advocate|Back-end Developer|Front-end Developer                     1
Other|Front-end Developer|Designer|One-person shop                                       1
Supervisor/Team Lead|DevOps/SysAdmin|Support|Back-end Developer|Front-end Developer      1
DevOps/SysAdmin|One-person shop                                                          1
Name: work_position, Length: 162, dtype: int64

In [25]:
mh_df.work_position.values

array(['Back-end Developer', 'Back-end Developer|Front-end Developer',
       'Back-end Developer', ..., 'Back-end Developer', 'DevOps/SysAdmin',
       'Other'], dtype=object)

In [26]:
mh_df['Job_title'] = ''

In [27]:
mh_df['Job_title'][5]

''

In [28]:
for i, row in mh_df.iterrows():
    if 'Developer' in row.work_position:
        mh_df['Job_title'][i] = 'Developer'
        
    elif 'Executive' in row.work_position:
        mh_df['Job_title'][i] = 'Executive'
        
    elif 'Supervisor' in row.work_position:
        mh_df['Job_title'][i] = 'Supervisor'
        
    elif 'Other' in row.work_position:
        mh_df['Job_title'][i] = 'Other'
        
    elif 'Team Lead' in row.work_position:
        mh_df['Job_title'][i] = 'Team Lead'

    elif 'Engineer' in row.work_position:
        mh_df['Job_title'][i] = 'Engineer'

    elif 'Analyst' in row.work_position:
        mh_df['Job_title'][i] = 'Analyst'

<ipython-input-28-1093d08e63ab>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mh_df['Job_title'][i] = 'Developer'
<ipython-input-28-1093d08e63ab>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mh_df['Job_title'][i] = 'Executive'
<ipython-input-28-1093d08e63ab>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mh_df['Job_title'][i] = 'Other'
<ipython-input-28-1093d08e63ab>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mh_df['Job_title'][i] = 'Supervisor'

In [29]:
mh_df[mh_df['Job_title'] == 'Executive']

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,gender,country_live,live_us_state,country_work,work_us_state,work_position,remote,quantile_age_1,quantile_age_2,Job_title
9,10,0,4,0,1.0,1,1.0,0,2,2,...,1,United States of America,Pennsylvania,United States of America,Pennsylvania,Executive Leadership,3,"(32.0, 38.0]","(32.0, 34.0]",Executive
13,14,0,4,1,NaN,2,0.0,0,2,2,...,1,United States of America,Oregon,United States of America,Oregon,Other|Executive Leadership,3,"(38.0, 99.0]","(44.0, 99.0]",Executive
41,42,0,3,1,NaN,0,NaN,0,0,2,...,1,Australia,NaN,Australia,NaN,Executive Leadership,0,"(32.0, 38.0]","(34.0, 37.0]",Executive
87,88,0,3,0,1.0,1,1.0,0,1,1,...,1,United States of America,Indiana,United States of America,Indiana,Executive Leadership|Supervisor/Team Lead,3,"(38.0, 99.0]","(44.0, 99.0]",Executive
123,124,0,2,1,NaN,1,1.0,0,1,1,...,1,United States of America,California,United States of America,California,Executive Leadership,3,"(19.999, 28.0]","(25.0, 27.0]",Executive
125,126,0,4,1,NaN,1,1.0,0,1,2,...,0,United States of America,California,United States of America,California,Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
155,156,0,5,1,NaN,1,1.0,1,1,1,...,1,United States of America,California,United States of America,California,Executive Leadership|Supervisor/Team Lead,3,"(28.0, 32.0]","(30.0, 32.0]",Executive
178,179,0,5,1,NaN,1,2.0,0,0,1,...,1,Germany,NaN,Germany,NaN,Executive Leadership,3,"(19.999, 28.0]","(25.0, 27.0]",Executive
197,198,0,5,1,NaN,1,1.0,0,2,2,...,0,United States of America,California,United States of America,California,Executive Leadership,3,"(32.0, 38.0]","(34.0, 37.0]",Executive
202,203,0,6,1,NaN,1,1.0,0,1,2,...,0,United States of America,Washington,United States of America,Washington,Executive Leadership|Dev Evangelist/Advocate,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
210,211,0,3,1,NaN,1,1.0,1,1,1,...,1,United States of America,Michigan,United States of America,Michigan,Support|HR|Supervisor/Team Lead|Executive Lead...,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
250,251,0,2,1,NaN,1,1.0,1,1,1,...,0,Canada,NaN,Canada,NaN,Executive Leadership,3,"(38.0, 99.0]","(44.0, 99.0]",Executive
279,280,0,4,1,NaN,1,1.0,1,1,1,...,1,United States of America,Maryland,United States of America,Maryland,DevOps/SysAdmin|Dev Evangelist/Advocate|Superv...,1,"(38.0, 99.0]","(39.0, 44.0]",Executive
286,287,0,2,1,NaN,2,2.0,0,0,1,...,1,Canada,NaN,Canada,NaN,HR|Supervisor/Team Lead|Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
332,333,0,4,1,NaN,0,NaN,0,0,1,...,1,United Kingdom,NaN,United Kingdom,NaN,Executive Leadership,3,"(38.0, 99.0]","(37.0, 39.0]",Executive
352,353,0,1,1,NaN,2,2.0,0,0,2,...,0,Canada,NaN,Canada,NaN,Executive Leadership,1,"(38.0, 99.0]","(39.0, 44.0]",Executive
416,417,0,6,0,1.0,1,0.0,2,1,2,...,1,United States of America,Pennsylvania,United States of America,New York,Executive Leadership,3,"(38.0, 99.0]","(44.0, 99.0]",Executive
447,450,0,6,1,NaN,1,1.0,2,2,2,...,1,United States of America,Illinois,United States of America,Illinois,Supervisor/Team Lead|Executive Leadership,3,"(28.0, 32.0]","(30.0, 32.0]",Executive
475,478,0,3,1,NaN,1,0.0,0,1,2,...,1,United States of America,Arizona,United States of America,Arizona,Executive Leadership,1,"(38.0, 99.0]","(44.0, 99.0]",Executive
477,480,0,2,1,NaN,0,NaN,0,0,2,...,1,United States of America,Minnesota,United States of America,Minnesota,Executive Leadership,3,"(28.0, 32.0]","(30.0, 32.0]",Executive
490,494,0,5,0,1.0,2,0.0,1,1,1,...,1,United States of America,Kansas,United States of America,Kansas,Executive Leadership|Supervisor/Team Lead,3,"(32.0, 38.0]","(32.0, 34.0]",Executive
492,496,0,2,1,NaN,1,2.0,0,0,1,...,1,United States of America,Illinois,United States of America,Illinois,Executive Leadership|Supervisor/Team Lead|Sales,3,"(19.999, 28.0]","(25.0, 27.0]",Executive
566,570,0,6,1,NaN,1,1.0,1,1,1,...,1,United States of America,Texas,United States of America,Texas,Executive Leadership,3,"(32.0, 38.0]","(34.0, 37.0]",Executive
580,584,0,6,1,NaN,1,1.0,2,1,1,...,0,United States of America,Maryland,United States of America,Maryland,Executive Leadership,1,"(38.0, 99.0]","(39.0, 44.0]",Executive
584,588,0,3,1,NaN,2,0.0,0,2,2,...,0,United States of America,Kansas,United States of America,Kansas,Executive Leadership,0,"(38.0, 99.0]","(44.0, 99.0]",Executive
725,729,0,2,1,NaN,1,1.0,1,1,1,...,1,United Kingdom,NaN,United Kingdom,NaN,Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
755,759,0,4,1,NaN,0,NaN,0,0,2,...,1,Australia,NaN,Australia,NaN,Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
765,769,0,1,1,NaN,3,0.0,0,0,0,...,1,United Kingdom,NaN,United Kingdom,NaN,Supervisor/Team Lead|Executive Leadership,3,"(28.0, 32.0]","(30.0, 32.0]",Executive
784,788,0,2,1,NaN,1,0.0,0,0,1,...,1,United States of America,North Carolina,United States of America,North Carolina,Executive Leadership,1,"(38.0, 99.0]","(44.0, 99.0]",Executive
863,867,0,4,0,1.0,1,1.0,0,0,1,...,1,United States of America,Alabama,United States of America,Alabama,Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
879,883,0,3,1,NaN,2,0.0,0,2,1,...,0,Netherlands,NaN,Netherlands,NaN,Executive Leadership,3,"(38.0, 99.0]","(44.0, 99.0]",Executive
881,885,0,6,1,NaN,1,1.0,0,1,2,...,1,Netherlands,NaN,Netherlands,NaN,Executive Leadership,3,"(38.0, 99.0]","(39.0, 44.0]",Executive
893,897,0,5,0,1.0,1,1.0,1,1,1,...,1,United Kingdom,NaN,United Kingdom,NaN,Executive Leadership,3,"(38.0, 99.0]","(37.0, 39.0]",Executive
963,967,0,6,1,NaN,1,2.0,1,1,2,...,1,United States of America,Pennsylvania,United States of America,Pennsylvania,Executive Leadership,0,"(28.0, 32.0]","(29.0, 30.0]",Executive
985,989,0,4,1,NaN,1,1.0,1,1,1,...,1,United Kingdom,NaN,United Kingdom,NaN,Executive Leadership,1,"(32.0, 38.0]","(34.0, 37.0]",Executive

In [30]:
salaries_df['Job_title'] = ''

In [31]:
salaries_df['Job_title'][5]

''

In [32]:
salaries_df.dtypes

work_position          object
Location               object
Years of Experience    object
Annual Base Pay         int64
Gender                 object
Job_title              object
dtype: object

In [33]:
salaries_df.isnull().sum()

work_position           26
Location               461
Years of Experience    290
Annual Base Pay          0
Gender                 159
Job_title                0
dtype: int64

In [34]:
salaries_df = salaries_df.dropna(axis = 0, how ='any')

In [35]:
salaries_df.dtypes

work_position          object
Location               object
Years of Experience    object
Annual Base Pay         int64
Gender                 object
Job_title              object
dtype: object

In [36]:
for i, row in salaries_df.iterrows():
    if 'Developer' in row.work_position:
        salaries_df['Job_title'][i] = 'Developer'
        
    elif 'Executive' in row.work_position:
        salaries_df['Job_title'][i] = 'Executive'
        
    elif 'Supervisor' in row.work_position:
        salaries_df['Job_title'][i] = 'Supervisor'
        
    elif 'Other' in row.work_position:
        salaries_df['Job_title'][i] = 'Other'
        
    elif 'Team Lead' in row.work_position:
        salaries_df['Job_title'][i] = 'Team Lead'

    elif 'Engineer' in row.work_position:
        salaries_df['Job_title'][i] = 'Engineer'

    elif 'Analyst' in row.work_position:
        salaries_df['Job_title'][i] = 'Analyst'

<ipython-input-36-5fe202b1b09f>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries_df['Job_title'][i] = 'Executive'
<ipython-input-36-5fe202b1b09f>:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries_df['Job_title'][i] = 'Engineer'
<ipython-input-36-5fe202b1b09f>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries_df['Job_title'][i] = 'Developer'
<ipython-input-36-5fe202b1b09f>:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries_df['Job_title'][i] = 'Analyst'
<ipython-input-36-5fe202b1b09f>:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries_df['Job_title'][i] = 'Team Lead'

In [37]:
salaries_df.dtypes

work_position          object
Location               object
Years of Experience    object
Annual Base Pay         int64
Gender                 object
Job_title              object
dtype: object

In [38]:
salaries_df[salaries_df['Job_title'] == 'Executive']

,work_position,Location,Years of Experience,Annual Base Pay,Gender,Job_title
19,Account Executive,"American Fork, UT",5,80000,Male,Executive
660,Executive Director of User Experience,New York,18,195000,Male,Executive
3026,Strategic Value Executive,Menlo Park,10,350000,Male,Executive

In [39]:
salaries_df.dtypes

work_position          object
Location               object
Years of Experience    object
Annual Base Pay         int64
Gender                 object
Job_title              object
dtype: object

In [40]:
salaries_df.head()

,work_position,Location,Years of Experience,Annual Base Pay,Gender,Job_title
6,Engineer,"San Francisco, CA",9,135000,Male,Engineer
7,Programmer,London,0,30187,Male,
19,Account Executive,"American Fork, UT",5,80000,Male,Executive
20,Accountant,"Kingsport, TN",2,62000,Male,
21,Ad Ops Coordinator,New York,1,55000,Male,

In [41]:
mh_df['Job_title'].value_counts()

Developer     655
              145
Other          95
Supervisor     74
Executive      35
Name: Job_title, dtype: int64

In [42]:
mh_df.Job_title.head()

0    Developer
1    Developer
2    Developer
3    Developer
4    Developer
Name: Job_title, dtype: object

In [43]:
mh_df.Job_title.isnull().sum()

0

In [44]:
mh_df.isnull().sum()

new_id                                     0
self_employed                              0
company_size                               0
tech_company                               0
tech_role                                768
mh_coverage                                0
mh_coverage_awareness                    103
mh_employer_discussion                     0
mh_resources_provided                      0
mh_anonimity                               0
mh_medical_leave                           0
mh_discussion_negative_impact              0
ph_discussion_negative_impact              0
mh_discussion_coworkers                    0
mh_discussion_supervisors                  0
mh_equal_ph                                0
mh_observed_consequences_coworkers         0
prev_employers                             0
prev_mh_benefits                         111
prev_mh_benefits_awareness               111
prev_mh_discussion                       111
prev_mh_resources                        111
prev_mh_anonimity                        111
prev_mh_discuss_negative_consequences    111
prev_ph_discuss_negative_consequences    111
prev_mh_discussion_coworkers             111
prev_mh_discussion_supervisors           111
prev_mh_importance_employer              111
prev_mh_consequences_coworkers           111
future_ph_specification                    0
future_mh_specification                    0
mh_hurt_on_career                          0
mh_neg_view_coworkers                      0
mh_sharing_friends_family                  0
mh_bad_response_workplace                 44
mh_for_others_bad_response_workplace     547
mh_family_history                          0
mh_dx_past                                 0
mh_dx_current                              0
yes_what_dx?                             584
maybe_whats_your_dx                      790
mh_dx_pro                                  0
yes_condition_dx                         482
mh_sought_pro_tx                           0
mh_eff_tx_impact_on_work                   0
mh_not_eff_tx_impact_on_work               0
age                                        0
gender                                     0
country_live                               0
live_us_state                            297
country_work                               0
work_us_state                            295
work_position                              0
remote                                     0
quantile_age_1                             0
quantile_age_2                             0
Job_title                                  0
dtype: int64

In [45]:
#mh_df = mh_df.dropna(axis = 0, how ='any')

In [46]:
mh_df

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,gender,country_live,live_us_state,country_work,work_us_state,work_position,remote,quantile_age_1,quantile_age_2,Job_title
0,1,0,3,1,NaN,3,NaN,0,0,2,...,1,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer
1,2,0,2,1,NaN,0,1.0,1,1,1,...,1,United States of America,Illinois,United States of America,Illinois,Back-end Developer|Front-end Developer,0,"(28.0, 32.0]","(27.0, 29.0]",Developer
2,3,0,2,1,NaN,0,NaN,0,0,2,...,1,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,1,"(32.0, 38.0]","(37.0, 39.0]",Developer
3,4,0,2,0,1.0,1,1.0,0,0,0,...,0,United States of America,Illinois,United States of America,Illinois,Executive Leadership|Supervisor/Team Lead|Dev ...,3,"(38.0, 99.0]","(39.0, 44.0]",Developer
4,5,0,6,1,NaN,1,2.0,0,1,1,...,1,United Kingdom,NaN,United Kingdom,NaN,DevOps/SysAdmin|Support|Back-end Developer|Fro...,3,"(38.0, 99.0]","(39.0, 44.0]",Developer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999,1003,0,4,1,NaN,2,2.0,0,2,2,...,0,Canada,NaN,Canada,NaN,Other,3,"(19.999, 28.0]","(25.0, 27.0]",Other
1000,1004,0,5,1,NaN,1,0.0,0,0,1,...,0,United States of America,Illinois,United States of America,Illinois,Support,1,"(32.0, 38.0]","(37.0, 39.0]",
1001,1005,0,4,1,NaN,1,1.0,1,1,2,...,1,United States of America,Georgia,United States of America,Georgia,Back-end Developer,3,"(38.0, 99.0]","(44.0, 99.0]",Developer
1002,1006,0,4,0,1.0,2,2.0,0,1,2,...,0,United States of America,Nebraska,United States of America,Nebraska,DevOps/SysAdmin,3,"(28.0, 32.0]","(29.0, 30.0]",
1003,1007,0,4,1,NaN,1,0.0,0,0,2,...,3,Canada,NaN,Canada,NaN,Other,3,"(19.999, 28.0]","(19.0, 25.0]",Other

mh_df

In [47]:
mh_df.isnull().sum()

new_id                                     0
self_employed                              0
company_size                               0
tech_company                               0
tech_role                                768
mh_coverage                                0
mh_coverage_awareness                    103
mh_employer_discussion                     0
mh_resources_provided                      0
mh_anonimity                               0
mh_medical_leave                           0
mh_discussion_negative_impact              0
ph_discussion_negative_impact              0
mh_discussion_coworkers                    0
mh_discussion_supervisors                  0
mh_equal_ph                                0
mh_observed_consequences_coworkers         0
prev_employers                             0
prev_mh_benefits                         111
prev_mh_benefits_awareness               111
prev_mh_discussion                       111
prev_mh_resources                        111
prev_mh_anonimity                        111
prev_mh_discuss_negative_consequences    111
prev_ph_discuss_negative_consequences    111
prev_mh_discussion_coworkers             111
prev_mh_discussion_supervisors           111
prev_mh_importance_employer              111
prev_mh_consequences_coworkers           111
future_ph_specification                    0
future_mh_specification                    0
mh_hurt_on_career                          0
mh_neg_view_coworkers                      0
mh_sharing_friends_family                  0
mh_bad_response_workplace                 44
mh_for_others_bad_response_workplace     547
mh_family_history                          0
mh_dx_past                                 0
mh_dx_current                              0
yes_what_dx?                             584
maybe_whats_your_dx                      790
mh_dx_pro                                  0
yes_condition_dx                         482
mh_sought_pro_tx                           0
mh_eff_tx_impact_on_work                   0
mh_not_eff_tx_impact_on_work               0
age                                        0
gender                                     0
country_live                               0
live_us_state                            297
country_work                               0
work_us_state                            295
work_position                              0
remote                                     0
quantile_age_1                             0
quantile_age_2                             0
Job_title                                  0
dtype: int64

In [48]:
mh_df['Job_title']

0       Developer
1       Developer
2       Developer
3       Developer
4       Developer
          ...
999         Other
1000
1001    Developer
1002
1003        Other
Name: Job_title, Length: 1004, dtype: object

In [49]:
mh_df.keys()

Index(['new_id', 'self_employed', 'company_size', 'tech_company', 'tech_role',
       'mh_coverage', 'mh_coverage_awareness', 'mh_employer_discussion',
       'mh_resources_provided', 'mh_anonimity', 'mh_medical_leave',
       'mh_discussion_negative_impact', 'ph_discussion_negative_impact',
       'mh_discussion_coworkers', 'mh_discussion_supervisors', 'mh_equal_ph',
       'mh_observed_consequences_coworkers', 'prev_employers',
       'prev_mh_benefits', 'prev_mh_benefits_awareness', 'prev_mh_discussion',
       'prev_mh_resources', 'prev_mh_anonimity',
       'prev_mh_discuss_negative_consequences',
       'prev_ph_discuss_negative_consequences', 'prev_mh_discussion_coworkers',
       'prev_mh_discussion_supervisors', 'prev_mh_importance_employer',
       'prev_mh_consequences_coworkers', 'future_ph_specification',
       'future_mh_specification', 'mh_hurt_on_career', 'mh_neg_view_coworkers',
       'mh_sharing_friends_family', 'mh_bad_response_workplace',
       'mh_for_others_bad_response_workplace', 'mh_family_history',
       'mh_dx_past', 'mh_dx_current', 'yes_what_dx?', 'maybe_whats_your_dx',
       'mh_dx_pro', 'yes_condition_dx', 'mh_sought_pro_tx',
       'mh_eff_tx_impact_on_work', 'mh_not_eff_tx_impact_on_work', 'age',
       'gender', 'country_live', 'live_us_state', 'country_work',
       'work_us_state', 'work_position', 'remote', 'quantile_age_1',
       'quantile_age_2', 'Job_title'],
      dtype='object')

In [50]:
salaries_df.keys()

Index(['work_position', 'Location', 'Years of Experience', 'Annual Base Pay',
       'Gender', 'Job_title'],
      dtype='object')

In [51]:
complete_mh_df = mh_df.merge(salaries_df, on='Job_title', how='left', suffixes=('_mh', '_salaries')
)

In [53]:
complete_mh_df.head()

,new_id,self_employed,company_size,tech_company,tech_role,mh_coverage,mh_coverage_awareness,mh_employer_discussion,mh_resources_provided,mh_anonimity,...,work_position_mh,remote,quantile_age_1,quantile_age_2,Job_title,work_position_salaries,Location,Years of Experience,Annual Base Pay,Gender
0,1,0,3,1,NaN,3,NaN,0,0,2,...,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer,Agent Developer,"Ã„ngelholm, Sweden",0,300000.0,Male
1,1,0,3,1,NaN,3,NaN,0,0,2,...,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer,Algorithmic Software Developer,Vancouver BC,3,90000.0,Male
2,1,0,3,1,NaN,3,NaN,0,0,2,...,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer,Developer,New England,1,60000.0,Male
3,1,0,3,1,NaN,3,NaN,0,0,2,...,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer,Associate Web Developer,"New York, NY",2,83000.0,Male
4,1,0,3,1,NaN,3,NaN,0,0,2,...,Back-end Developer,3,"(38.0, 99.0]","(37.0, 39.0]",Developer,Backend Developer,Hamburg,7,43800.0,Male

In [ ]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/movie_data"

In [ ]:
pip install psycopg2-binary

In [ ]:
engine = create_engine(db_string)

In [ ]:
complete_mh_df.to_sql(name='mh', con=engine)

In [ ]:
rows_imported = 0
# get the start_time from time.time()
start_time = time.time()
for data in pd.read_csv(f'{file_dir}ratings.csv', chunksize=1000000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='ratings', con=engine, if_exists='append')
    rows_imported += len(data)

    # add elapsed time to final print out
    print(f'Done. {time.time() - start_time} total seconds elapsed')